// week 7
// pointer หรือ ตัวแปรตัวชี้ เป็นตัวแปรพิเศษที่ใช้ในการจัดเก็บที่อยู่มากกว่าค่า
// วิธีประกาศ pointer คือ
int *p;
// การกำหนดที่อยู่ให้กับ pointer
int *pc, c;
c = 5;
pc = &c;
// เครื่องหมาย แอมเปอร์แซนด์ (&) หมายถึงที่อยู่ในหน่วยความจำ
// 5 จะถูกกำหนดให้กับตัวแปร c และที่อยู่ของ c ถูกกำหนดให้กับตัวชี้ pc
// รับค่าของสิ่งที่ชี้โดย Pointers
// ในการรับค่าของสิ่งที่ชี้โดย pointer เราจะใช้ *operator
// เช่น
int* pc, c;
c = 5;
pc = &c;
printf("%d", *pc);   // Output: 5
// ที่อยู่ของ c ถูกกำหนดให้กับตัวชี้ pc จะได้รับค่าที่เก็บไว้ในที่อยู่ที่เราใช้ * เครื่องคอมพิวเตอร์

// การเปลี่ยนแปลงมูลค่าที่ชี้โดยตัวชี้
int* pc, c;
c = 5;
pc = &c;
c = 1;
printf("%d", c);    // Output: 1
printf("%d", *pc);  // Ouptut: 1
// เราได้กำหนดที่อยู่ของ c ให้กับตัวชี้ pc
// จากนั้นเราเปลี่ยนค่าของ c เป็น 1 เนื่องจาก pc และที่อยู่ของ c เหมือนกัน *pc ทำให้เรามี 1
// ตัวชี้ NULL
// การกำหนดค่า NULL ให้กับตัวแปรตัวชี้ในกรณีไม่มีที่อยู่ที่แน่นอนที่จะกำหนด
// ตัวชี้ NULL เป็นค่าคงที่ที่มีค่าเป็นศูนย์ที่กำหนดไว้ในไลบรารีมาตรฐาน
// เช่น
int main () {

   int  *ptr = NULL;

   printf("The value of ptr is : %x\n", ptr  );
 
   return 0;
}
// ได้ผลลัพธ์เป็น
// The value of ptr is 0