// week 6
// Array เป็นตัวแปรที่สามารถเก็บค่าได้หลายค่า
// รูปแบบของ Array
dataType arrayName [arraySize];
// เช่น
int data[100]; // สามารถเก็บจำนวนเต็มได้ 100 จำนวน
// ขนาดและประเภทของ array ไม่สามารถเปลี่ยนแปลงได้เมื่อประกาศแล้ว
// แต่สามารถเปลี่ยนค่าในตัวเก็บ array ต่างๆได้
// เช่น
int mark[5] = {19, 10, 8, 17, 9};
mark[2] = -1; // ตำแหน่ง mark[2] = 8 จะเปลี่ยนไปเป็น mark[2] = -1
mark[4] = 0; // เช่นเดียวกับกรณีบน

// ผู้ใช้งานสามารถนำค่าเข้าและเก็บไว้ใน array ได้ ดังนี้
scanf("%d", &mark[2]);

// การ #define เป็นคำสั่งที่สั่งให้ compiler เปลี่ยนอักษรทั้งหมดในโปรแกรมก่อนคอมไพล์
#define arraySize[5]
int main(){
    int A[arraySize] = {0,1,2,3,4};
}
// เปลี่ยนคำว่า arraySize ให้เป็น 5 ให้หมด

// const เป็นคีย์เวิร์ดที่บังคับว่าตัวแปรนี้ไม่สามารถเปลี่ยนแปลงค่าได้ตลอดการทำงานของโปรแกรม
// เช่น const int arraySize = 5;
// pass by value จะก็อปปี้ค่าของตัวแปรจากผู้เรียกไปให้ฟังก์ชัน
// สร้างตัวแปร local variable ใหม่ในฟังก์ชัน และ การเปลี่ยนแปลงค่าในฟังก์ชันไม่ส่งผลถึงตัวแปรต้น
// pass by reference จะส่งตำแหน่งของตัวแปรจากผู้เรียกไปให้ฟังก์ชัน
// ตัวแปรในฟังก์ชันเป็นตัวเดียวกันกับผู้เรียก และ การเปลี่ยนแปลงค่าในฟังก์ชันเปลี่ยนตัวแปรต้นด้วย

// array 2 มิติ เป็นตาราง ประกาศแบบสองชั้น
// เช่น int A[2][3];
